{
  "products": [
    {
      "url": "https://shoppopeyes.com/en/collections/proteines-proteins/products/ans-n-mass-15lbs",
      "title": "ANS N Mass 15lbs",
      "price": "114.99",
      "description": "In order to get big, you have to eat big. Consuming enough calories to grow can be difficult for those with highly active metabolisms or weaker appetites. N-MASS provides a convenient way to consume 1,300 high quality calories derived from 55g protein, 250g of carbohydrates and 9g fat; with added creatine monohydrate and Appelin in every serving. Nothing will fuel your workout recovery and trigger muscle growth faster! High quality cold-processed membrane filtered protein Clean carb real food complex: chia, sweet potato, brown rice, corn, quinoa & oats Healthy fat sources: coconut, MCTs & flax seed Featuring Appelin: natural appetite support complex Increases muscle size & strength with 3g of creatine per serving Added digestive enzymes to support absorption Incredible taste with no added sugars"
    },
    {
      "url": "https://shoppopeyes.com/en/collections/proteines-proteins/products/believe-collagen-refresher-255g-310g",
      "title": "Believe Collagen Refresher 255g-310g",
      "price": "49.99",
      "description": "The Most Refreshing Way to Take Collagen! Turn your daily collagen into a drink youll actually crave. With 10 g of premium marine collagen plus Vitamin C and Magnesium, Collagen Refresher helps support joints, recovery, and connective tissue, all in light, refreshing flavours made to sip over ice. Feel good, taste amazing, its collagen you wont forget to take."
    },
    {
      "url": "https://shoppopeyes.com/en/collections/proteines-proteins/products/good-protein-high-protein-shake-940g",
      "title": "Good Protein High Protein Shake 940g",
      "price": "64.99",
      "description": "Meet the all-new High-Protein Shake! Your optimal post-workout recovery, ready in seconds. Just add to water. 32g of protein 5g of BCAAs Whats the difference between the 32g High Protein Shake and the All-in-One Shake? The main difference is in their purpose! The All-in-One Shake offers a more complete, nutritionally balanced formula that contains more than just protein. It's designed to help your body thrivewhether you're powering through a busy workday or simply looking for a healthy, delicious daily ritual. The 32g High Protein Shake is your new post-workout recovery solution. Packed with 32g of protein and 5g of BCAAs, its made to support muscle growth and recovery. Whether you're coming off a tough workout, training for your next race, or just want an extra protein boost, this shake has your back. In short: the All-in-One Shake is your go-to for daily wellness and balanced nutrition. The 32g High Protein Shake is your partner for fitness and recovery. Two shakes. Two purposes. One mission: help you feel your best. Is the texture for the 32g High Protein Shake similar to the All-in-One Shake? Of course! Our 32g High Protein Shake has the same smooth and creamy texture you know and love."
    },
    {
      "url": "https://shoppopeyes.com/en/collections/proteines-proteins/products/good-protein-high-protein-shake-470g",
      "title": "Good Protein High Protein Shake 470g",
      "price": "39.99",
      "description": "Meet the all-new High-Protein Shake! Your optimal post-workout recovery, ready in seconds. Just add to water. 32g of protein 5g of BCAAs Whats the difference between the 32g High Protein Shake and the All-in-One Shake? The main difference is in their purpose! The All-in-One Shake offers a more complete, nutritionally balanced formula that contains more than just protein. It's designed to help your body thrivewhether you're powering through a busy workday or simply looking for a healthy, delicious daily ritual. The 32g High Protein Shake is your new post-workout recovery solution. Packed with 32g of protein and 5g of BCAAs, its made to support muscle growth and recovery. Whether you're coming off a tough workout, training for your next race, or just want an extra protein boost, this shake has your back. In short: the All-in-One Shake is your go-to for daily wellness and balanced nutrition. The 32g High Protein Shake is your partner for fitness and recovery. Two shakes. Two purposes. One mission: help you feel your best. Is the texture for the 32g High Protein Shake similar to the All-in-One Shake? Of course! Our 32g High Protein Shake has the same smooth and creamy texture you know and love."
    },
    {
      "url": "https://shoppopeyes.com/en/collections/proteines-proteins/products/xp-labs-iso-xp-5lbs",
      "title": "XP Labs ISO XP 5lbs",
      "price": "134.99",
      "description": "What Makes ISO XP Superior? Advanced Whey ProcessingCrafted using state-of-the-art methods to preserve purity and quality. Fully Undenatured WheyMaintains the proteins natural structure for optimal effectiveness. Cold-Processed IsolatesLow-temperature filtration preserves nutrients and bioavailability. High-Quality, Grass-Fed DairySourced from responsibly raised, grass-fed cows for superior nutrition. Clean and PureFree from antibiotics, pesticides, and added hormones."
    },
    {
      "url": "https://shoppopeyes.com/en/collections/proteines-proteins/products/ghost-clear-whey-640g",
      "title": "Ghost Clear Whey Isolate 640g",
      "price": "79.99",
      "description": "LIGHT. REFRESHING. LEGENDARY.GHOST® CLEAR WHEY is our new favorite way to fuel: zero fat, zero sugar, 25 g of whey protein isolate, in all your favorite GHOST® flavors. Suggested UseMix one scoop of GHOST® CLEAR WHEY with 16 oz of water or beverage of choice. After mixing, wait 60 seconds for the foam to settle before consuming. Adjust liquid amount to taste. Soy Free Gluten Free Sugar Free"
    },
    {
      "url": "https://shoppopeyes.com/en/collections/proteines-proteins/products/misfits-boite-de-barres-vegane-15-misfits-box-of-vegan-bars-15",
      "title": "Misfits Box of Vegan Bars (15)",
      "price": "54.99",
      "description": "Next Generation Snacking! The plant-based, high protein, low sugar snack. 15g protein 1g sugar 190 calories 5g fiber 100% Vegan"
    },
    {
      "url": "https://shoppopeyes.com/en/collections/proteines-proteins/products/misfits-barre-vegane-a-lunite-1-misfits-single-vegan-bar-1",
      "title": "Misfits Single Vegan Bar (1)",
      "price": "3.99",
      "description": "Next Generation Snacking! The plant-based, high protein, low sugar snack. 15g protein 1g sugar 190 calories 5g fiber 100% Vegan"
    },
    {
      "url": "https://shoppopeyes.com/en/collections/proteines-proteins/products/basic-mass-gainer-15lb",
      "title": "Basic Mass Gainer 15lb",
      "price": "99.99",
      "description": "Basic Mass is our straightforward, high-calorie mass gainer designed to help you increase size and strength while maintaining a balanced nutritional profile. Formulated with a quality carb complex, it provides the essential nutrients you need to fuel your workouts and support muscle growth. Bulk up effectively with Basic Mass, your essential mass gainer that gets back to the basics of effective muscle building without the B.S. How to Use Mix 4 scoops (265 g) of powder with 8-16 oz of cold water and consume 1 serving per day. Shake/blend."
    },
    {
      "url": "https://shoppopeyes.com/en/collections/proteines-proteins/products/basic-isolate-2lb",
      "title": "Basic Isolate 2lb",
      "price": "59.99",
      "description": "Why Choose Basic Whey Protein Isolate? Easy to Digest: Gentle on the stomach for efficient absorption. rBST-Free: Made without artificial growth hormones. Build & Repair Body Tissue: Supports muscle recovery and tissue repair. Boosts Immunity: Helps build antibodies for a strong immune system. Complete Amino Acid Profile: Provides all essential amino acids for optimal performance. Basic Whey Protein Isolate is designed to meet the needs of everyonefrom beginners to elite athletes. Fuel your body, recover faster, and perform at your best!"
    },
    {
      "url": "https://shoppopeyes.com/en/collections/proteines-proteins/products/good-protein-all-in-one-shake",
      "title": "Good Protein All-in-one Shake 880g",
      "price": "61.99",
      "description": "Complete Nutrition, In One Shake Plant-Based Protein 21 grams of complete protein, with 9 essential amino acids. Nutrient-Rich Greens Source of over 36 essential vitamins, minerals and micronutrients. Fibre Dietary fibre that feeds the friendly bacteria in your gut. Digestive Blend Probiotics and digestive enzymes that contribute to healthy gut flora. No Added Sugar Real flavours that taste like real desserts, without any added sugar. Incredibly Smooth High-quality ingredients give our shakes their perfect texture. Plant-based protein Organic superfoods Vitamins + minerals Probiotics + fibres Antioxidants BCAAs Omegas + MCTs"
    },
    {
      "url": "https://shoppopeyes.com/en/collections/proteines-proteins/products/good-protein-all-in-one-shake-440g",
      "title": "Good Protein All-in-one Shake 440g",
      "price": "37.99",
      "description": "Complete Nutrition, In One Shake Plant-Based Protein 21 grams of complete protein, with 9 essential amino acids. Nutrient-Rich Greens Source of over 36 essential vitamins, minerals and micronutrients. Fibre Dietary fibre that feeds the friendly bacteria in your gut. Digestive Blend Probiotics and digestive enzymes that contribute to healthy gut flora. No Added Sugar Real flavours that taste like real desserts, without any added sugar. Incredibly Smooth High-quality ingredients give our shakes their perfect texture. Plant-based protein Organic superfoods Vitamins + minerals Probiotics + fibres Antioxidants BCAAs Omegas + MCTs"
    },
    {
      "url": "https://shoppopeyes.com/en/collections/proteines-proteins/products/basic-mass-gainer-6lb",
      "title": "Basic Mass Gainer 6lb",
      "price": "49.99",
      "description": "Basic Mass is our straightforward, high-calorie mass gainer designed to help you increase size and strength while maintaining a balanced nutritional profile. Formulated with a quality carb complex, it provides the essential nutrients you need to fuel your workouts and support muscle growth. Bulk up effectively with Basic Mass, your essential mass gainer that gets back to the basics of effective muscle building without the B.S. How to Use Mix 4 scoops (265 g) of powder with 8-16 oz of cold water and consume 1 serving per day. Shake/blend."
    },
    {
      "url": "https://shoppopeyes.com/en/collections/proteines-proteins/products/basic-isolate-5lb",
      "title": "Basic Isolate 5lb",
      "price": "119.99",
      "description": "Why Choose Basic Whey Protein Isolate? Easy to Digest: Gentle on the stomach for efficient absorption. rBST-Free: Made without artificial growth hormones. Build & Repair Body Tissue: Supports muscle recovery and tissue repair. Boosts Immunity: Helps build antibodies for a strong immune system. Complete Amino Acid Profile: Provides all essential amino acids for optimal performance. Basic Whey Protein Isolate is designed to meet the needs of everyonefrom beginners to elite athletes. Fuel your body, recover faster, and perform at your best!"
    },
    {
      "url": "https://shoppopeyes.com/en/collections/proteines-proteins/products/basic-whey-5lb",
      "title": "Basic Whey 4lb",
      "price": "69.99",
      "description": "Why Choose Basic Whey Protein Isolate? Easy to Digest: Gentle on the stomach for efficient absorption. rBST-Free: Made without artificial growth hormones. Build & Repair Body Tissue: Supports muscle recovery and tissue repair. Boosts Immunity: Helps build antibodies for a strong immune system. Complete Amino Acid Profile: Provides all essential amino acids for optimal performance. Basic Whey Protein Isolate is designed to meet the needs of everyonefrom beginners to elite athletes. Fuel your body, recover faster, and perform at your best!"
    },
    {
      "url": "https://shoppopeyes.com/en/collections/proteines-proteins/products/basic-whey-2lb",
      "title": "Basic Whey 2lb",
      "price": "44.99",
      "description": "Why Choose Basic Whey? Supports Muscle Protein Synthesis: Helps build and maintain lean muscle mass. rBST-Free: Made without artificial growth hormones. Build & Repair Body Tissue: Essential for recovery and tissue repair. Boosts Immunity: Supports antibody production for a healthy immune system. Third-Party Lab Tested: Ensures quality, safety, and purity. Basic Whey is a superior protein blend, perfect for post-workout recovery. Build muscle, recover faster, and maintain your health with confidence!"
    },
    {
      "url": "https://shoppopeyes.com/en/collections/proteines-proteins/products/mutant-mass-5lbs",
      "title": "Mutant Mass 5lbs",
      "price": "53.49",
      "description": "MUTANT MASS contains 1100 calories per serving, including 56g of pure protein, 192g of clean carbs, 6g of fat, 26.1g of EAA and 12.2g of naturally occurring BCAAs. It is made with essential fatty acids, natural whole foods (barley, sweet potato, oatmeal) and natural oils (avocado, coconut oil, flax seed, pumpkin seed and sunflower oil). 1,100 calories per serving Made with natural whole foods (barley, sweet potato, rolled oats, avocado, coconut oil, flaxseed, pumpkin seed and sunflower oil) 56 g of pure protein, 192 g of clean carbs, 6 g of fat 26.1 g of EAAs and 12.2 g of BCAAs (naturally present) Essential fatty acids (EFAs) and natural oils from coconut, avocado, flaxseed, pumpkin seed and sunflower Engineered in our own state-of-the-art manufacturing facility to maintain gold-standard quality"
    },
    {
      "url": "https://shoppopeyes.com/en/collections/proteines-proteins/products/nutrabolics-hydropure-4-5lb",
      "title": "Nutrabolics Hydropure 4.5lb",
      "price": "129.99",
      "description": "NUTRABOLICS HYDROPURE 100% HYDROLYZED WHEY PROTEIN When training gets intense, serious athletes cant afford any delays in the muscle-building process. Unlike standard proteins or whey isolates, HYDROPUREs® premium 100% whey hydrolysates are specially-designed to accelerate protein absorption and synthesis. Ultra-low in carbs and fat, this elite whey protein provides lean, delicious, and lightning-fast nutrition for high-performing athletes who demand the best. 100% HYDROLYZED WHEY FASTEST ABSORBING PROTEIN SUPPORTS MUSCLE GROWTH 3RD PARTY QUALITY TESTED"
    },
    {
      "url": "https://shoppopeyes.com/en/collections/proteines-proteins/products/canprev-collagen-beauty-500ml",
      "title": "CanPrev Collagen Beauty 500ml",
      "price": "31.99",
      "description": "Reduce wrinkles in 28 days Activate skin collagen production and increase skin elasticity Smooths and firms skin Increase moisture in the skin Improve nail growth Supports cellulite reduction By supporting skin elasticity and healthy collagen production, Collagen Beauty helps improve the appearance of skin, reduces wrinkles and diminishes fine lines. Designed to stimulate fibroblast cells in the skin, to enhance collagen metabolism where its needed. This unique liquid formula contains bioactive epidermal collagen peptides that are clinically proven to help reduce eye wrinkles in as early as 28 days."
    },
    {
      "url": "https://shoppopeyes.com/en/collections/proteines-proteins/products/pvl-clean-mass-xl-10lbs",
      "title": "PVL Clean Mass XL 10lbs",
      "price": "111.99",
      "description": "THE CLEANER GAINER! You cant meet your full potential when youre not eating enough nutrient-rich calories to recover from intense training sessions. Protein shakes sometimes simply are not enough! The problem a lot of mass gainer shakes are full of sugar, low-quality ingredients, and artificial additives that can be hard to digest and slow down performance. CLEAN FOODS FOR CLEAN GAINS! PVL CLEAN MASS XL is a premium blend of 25 real food ingredients to provide athletes with high calorie & high-quality nutrition to fuel their sport. This delicious clean mass gainer is made with complete proteins, clean carbs, healthy fats, pre- and probiotics, digestive enzymes, electrolytes, greens, and fruits to help energize every movement. CLEAN MASS XL doesnt just help build mass - it helps build a healthy foundation for all athletic pursuits. KEY BENEFITS 60g Complete Protein 25 Real Food Ingredients 38g EAAs, BCAAs, Glutamine 200g Clean Carbs (Organic Quinoa, Brown Rice, Sweet Potato & more) 3g Healthy Fats & Zero Added Sugars Greens Micronutrients (Broccoli, Spinach, Kale & more) Digestive Enzymes & Electrolytes including Aquamin® Marine Calcium Banned substance tested by Informed Choice Per 2 daily servings /// CLEAN TESTED APPROVED /// ZERO artificial colours or flavours CLEAN formula, quality ingredients TESTED by Informed Choice TRUE GMP verified quality UNRIVALED 25+ years XP FOR ATHLETES by athletes"
    },
    {
      "url": "https://shoppopeyes.com/en/collections/proteines-proteins/products/believe-protein-refresher-656g",
      "title": "Believe Protein Refresher 656g",
      "price": "69.99",
      "description": "PRO TIP: Drink you Protein Refresher with ice or chill water for superior taste! Introducing our Juice Type Isolate protein Available in many delicious flavors The most convenient way to boost your daily protein intake and give you more energy at work or during other activities Contains all the essential amino acids needed to build muscle and improve recovery Is this product for me? Yes if ▪ You need to increase the amount of protein you eat ▪ You want a quick and easy snack ▪ You want a protein powder that has a very high level of purity No if ▪ You are allergic to any milk product ▪ You are already getting enough protein from regular nutrition Introducing our Juice Type Isolate protein, a revolutionary alternative to traditional milk-based protein shakes. Prepare for a taste experience unlike any other with our ultimate light and refreshing protein drink. Designed to redefine the way you fuel your body, Believe protein refreshers offer a texture that is delightfully different from the typical milky protein shake. It's more akin to savouring your favourite juice, delivering a one-of-a-kind refreshment that will leave you craving more."
    },
    {
      "url": "https://shoppopeyes.com/en/collections/proteines-proteins/products/biox-power-casein-complex-5lb",
      "title": "Biox Power Casein Complex 5lb",
      "price": "104.99",
      "description": "POWER CASEIN COMPLEX is specifically formulated to provide a sustained release of amino acids over the course of 5-8 hours. This makes POWER CASEIN COMPLEX an ideal protein to consume before a long day, or before bedtime to ensure that your muscles always have amino acids feeling their recovery. Combined with our delicious flavouring system, It delivers a thick, rich, and smooth shake that will leave you satisfied for hours. ULTRA SUSTAINED- RELEASE PROTEIN COMPLEX Sustained Slow-Release Protein High In BCAAs (Branched-Chain Amino Acids) Delicious, Rich, and Smooth"
    },
    {
      "url": "https://shoppopeyes.com/en/collections/proteines-proteins/products/progressive-fast-acting-collagen-90-caps",
      "title": "Progressive Fast Acting Collagen 90 caps",
      "price": "34.99",
      "description": "Fast-acting joint pain relief in 5 5-days, formulated with multiple collagen types and sources (marine, chicken,bovine) Helps to reduce joint pain and stiffness. Helps to relieve stiffness associated with chronic joint pain. Helps to support health by reducing joint pain and stiffness. Helps to reduce joint pain in knee osteoarthritis. A unique complex formula containing marine, bovine and chicken collagen sources, providing joint pain relief."
    },
    {
      "url": "https://shoppopeyes.com/en/collections/proteines-proteins/products/younited-all-in-one-plant-protein-775g",
      "title": "Younited All-In One Plant Protein 775g",
      "price": "64.99",
      "description": "Faster than a bowl of cereal with way more nutrients, Youniteds All-In-One Plant Protein + Superfoods will help set your day up for success. With 21 g of organic plant protein + 53 organically grown veggies, fruits, mushrooms and herbs, this great tasting powder is a nutrition powerhouse. Smooth and creamy, with no chalky aftertaste. Good enough to drink with water alone, or add your favourite plant milk, or amp up your favourite smoothie in the blender. Available in two delicious flavours: Vanilla (775 grams) and Chocolate (825 grams), both contain 25 servings per bag. 21 g of complete plant protein per scoop (full amino acid profile) 5 g of carbs less than 1 g of sugar Great taste, smooth texture Vegan, Paleo, Keto No artificial colours, flavours or sweeteners Made in Canada"
    }
  ],
  "totalScraped": 24,
  "errors": [],
  "scrapedAt": "2025-12-09T22:10:48.973Z"
}